# IsConstrainedOnHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadBase..::..IsConstrainedOnHost Property
LoadBase Class See Also
---
The load is constrained to host or not.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsConstrainedOnHost { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsConstrainedOnHost As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsConstrainedOnHost {
	bool get ();
}
```

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace